const articles = [
    {
        id: "0",
        title: "如何学习咏春拳",
        content:
            `
            咏春拳是一种强调近距离格斗，通过快速出拳和严密防守来战胜对手的功夫。这一中国传统武术攻守同期，通过快速移动的步法借力打力，从而击败对手。这种功夫非常复杂，往往需要多年的练习才能掌握一二，但是初学者可以通过了解咏春拳的原理、理论和基本技巧，轻松地开始学习这一拳法。
            <img  style=" display: block;margin: auto;width: 80%;" src="https://www.wikihow.com/images/thumb/8/8c/Learn-Wing-Chun-Step-1-Version-7.jpg/v4-728px-Learn-Wing-Chun-Step-1-Version-7.jpg.webp" />
            1学习中线理论。咏春拳的基础是保护你身体的中线。想象有一条线从头顶的中心开始，沿着胸部中间一直延伸到下半身。这就是你身体的中心线，它十分脆弱，应当一直受到保护。[1]根据中线理论，你应该始终沿着中线配合进攻，并防守对手的中线攻击。中线理论是咏春拳基本开立姿势的基础。在开放式站姿中，要面朝前站立，膝盖弯曲，双脚微微向外撇。正面朝敌，并用最平衡的力量进攻。
            <img  style=" display: block;margin: auto;width: 80%;" src="https://www.wikihow.com/images/thumb/c/cc/Learn-Wing-Chun-Step-2-Version-7.jpg/v4-728px-Learn-Wing-Chun-Step-2-Version-7.jpg.webp" />
            2学会聪明并适度地发力。咏春拳的一个重要原则是在对打中“不尚力”，即用力要适度。要借力打力，通过偏转或重定向打击的方法，借用对手的力量。[2]要合理、省力地出击。这意味着你的肢体应该在最少的时间内，通过最短的距离击中对方。同时，这样也有助于节省体力。
            <img  style=" display: block;margin: auto;width: 80%;" src="https://www.wikihow.com/images/thumb/c/ca/Learn-Wing-Chun-Step-3-Version-7.jpg/v4-728px-Learn-Wing-Chun-Step-3-Version-7.jpg.webp" />
            `,
        publishTime: "2021-04-23 21:23:20",
        readNums: "100",
        firstPic: "https://www.wikihow.com/images/thumb/8/8c/Learn-Wing-Chun-Step-1-Version-7.jpg/v4-728px-Learn-Wing-Chun-Step-1-Version-7.jpg.webp",
    },
    {
        id: "1",
        title: "咏春脚法、腿法要不要“提膝”？这篇文章讲清楚了咏春腿法这样踢",
        content:
            `
            前提条件一是怎么定义提膝，通常对于大多数武术来说“提膝就是小腿大腿折叠夹紧，同时缩短大腿与躯干的距离，膝盖向上抬起”。

            如果大、小腿稍微折叠，没有夹紧大、小腿，那么这种情况就有两个答案了：A也算提膝，B不算提膝。这么一来要不要“提膝”这个词就不够严谨了。

            我们换一种表达方式（以人类目前的身体结构），让踢击既快速又有劲力的踢法，在讲述方式上应该用大小腿折叠程度来说明更为合理和严谨，（以下简称“折叠”）。严谨的表达才不会让学员产生误解。

            前提条件二是踢击高度，如果是咏春里的左右扫踢、后扫踢等，几乎是贴着地面的，则不用提膝，破骨踢也不用提膝，膝盖处的几种踢法则根据距离远近选择折叠的程度，随着踢击高度的增加，从胸腹部开始就要在保证速度和隐蔽性的情况下，适当折叠大小腿及大腿与躯干的距离。

            总之，踢击时根据腿法、脚法类型、踢击距离、踢击高度等灵活变通，不刻意夹腿夹膝，也不是完全伸直，灵活运用关节的屈伸。

            使用的情况不同，腿法、脚法不同才决定要不要“折叠”，大小腿折叠多少视情况而定。

            多种训练，你的踢击技术和腿法感知能力就比只训练一种更加丰富，使用的时候也就更加从容自如，从而开发更多潜力。

            即使像有些人讲的咏春腿法不提膝，其实你会发现出腿时也会多多少少有一些大小腿些折叠的现象，不然就像直杆一样只能“撑”不能“踢”,难看又不灵活，更别说发力了。

            <h3>使用的时候有两种踢击距离需要考虑</h3>
            一是，较远距离的时候“少折叠”，最好选择提膝不太明显的“铲踢”，就是加上垫步，用前腿的踢击方法（李小龙喜欢用的踢击方法，隐蔽又有速度）和后腿直接踢两种踢法。

            二是，配合手法时，如果是较近距离，又需要踢击较高位置，这时候不得不“折叠”，用折叠以求得合适的踢击空间。

            另一种情况是发力，从人体肌肉分布上来看，我们的臀大肌和股四头肌是最有力量的两大块肌肉，如果折叠整条腿部再进行舒展将会启用到这两块肌肉(比如侧踢)。所以踢击训练时在保证隐蔽性、踢击距离和速度的情况下，要考虑这个动作是否有更多肌肉参与了。这是很多人忽视的。

            会有人反对说你这就不是咏春腿法了！非也

            那好，我们举例说明一下：

            如果只是单纯的把腿直直抬起则只能用到髂腰肌，附带用上腹直肌股四头肌，就算是用上支撑脚的发力虽能发出力量，结构也比较稳定（有一定功力的人），但是仍然不能将力量发挥到最大，因为这闲置了最有力的臀大肌和股四头肌。

            这就是咏春腿法

            所以从发力的角度来分析，也是需要适当折叠腿，但同时也要考虑隐蔽性、踢击距离和速度。

            综上所述，折叠与否需要根据自己遇到的实际情况进行灵活变通和融合互补，并不是一成不变的。

            最后忠告，平时训练的要富余，用时要精简。

            咏春拳行者功夫，咏春腿法、脚法课程正在筹备中，敬请期待。

            课程将解决：

            1、初学者入门难，学不会的问题；

            2、有训练经验的同仁，对咏春踢击动作的种种疑惑；

            3、不知动作怎么踢的问题，清晰讲解每个高阶踢击动作如何踢出；

            4、踢击技法不够全面，补充咏春踢击动作的不足；

            5、延伸踢击技法如何踢。

            腿法举例：

            以咏春正脚侧视图为例

            看看咏春脚法是如何踢出的

            <img  style=" display: block;margin: auto;width: 80%;" src="https://nimg.ws.126.net/?url=http%3A%2F%2Fdingyue.ws.126.net%2F2022%2F0305%2Fe66739d2j00r89n8d001ed000v900imp.jpg&thumbnail=660x2147483647&quality=80&type=jpg" />
            <img  style=" display: block;margin: auto;width: 80%;" src="https://nimg.ws.126.net/?url=http%3A%2F%2Fdingyue.ws.126.net%2F2022%2F0305%2F54ede6f8j00r89n6t0041c000u002qlm.jpg&thumbnail=660x2147483647&quality=80&type=jpg" />
            <img  style=" display: block;margin: auto;width: 80%;" src="https://nimg.ws.126.net/?url=http%3A%2F%2Fdingyue.ws.126.net%2F2022%2F0305%2F54ede6f8j00r89n6t0041c000u002qlm.jpg&thumbnail=660x2147483647&quality=80&type=jpg" />
            
            图一 大部分的武术踢击是第一类发力方法及走向——先提膝，后踢出，攻击所用的路线最长。且踢击力是单腿，攻击所产生的反作用力，会向身后。

            图二 中阶咏春脚可以踢出较短的攻击路线，但踢击会令目标产生向上的力，会令对手重心上浮，卸去攻击力度，虽未能一脚制敌，但对手马步上浮，未能作出有效防御或移动，只要补上快拳便轻易击中。

            图三 正确高阶咏春脚法是走最短路线的，可向大地借力，将反作用力作用在地上，由于地面没有卸力点，力量流只能向踢击一方转导，力量倍增，所以可以做到“逢中必伤”。
            `,
        publishTime: "2022-03-05 17:50:17",
        readNums: "45",
        firstPic: "https://nimg.ws.126.net/?url=http%3A%2F%2Fdingyue.ws.126.net%2F2022%2F0305%2Fe66739d2j00r89n8d001ed000v900imp.jpg&thumbnail=660x2147483647&quality=80&type=jpg",
    },
    {
        id: "2",
        title: "（图文）咏春拳教学体系三拳一桩一刀一棍详解",
        content:
            `
            三拳指的是咏春拳的三个套路：小念头、寻桥、标指。

            一桩指的是木人桩。

            一刀指的是咏春的短刀兵器八斩刀

            一棍指的是咏春的长棍兵器六点半棍。

            接下来分别讲解每一项的训练要领：

            <h3>1 小念头</h3>
            小念头是咏春拳一个初级套路，它的动作招式不多，但它集中了咏春拳攻防的最基本的招式和手法，练好小念头各个招式动作组合，就能为进一步学习打下坚实的基础。

            以“小念头”作为咏春牌第一首拳套之称别具含义。当一名初学者启蒙之日，教者会以告诫的语气对说：“小念头不正，终身不正；习武如是，做人如是。”----这道理简单；因为小念头内包含了咏春拳的各种基本动作，二日后的千变万化的招式，无不靠此等动作组成；若练习者连这首基础拳都练不好，其日后技术之坏将不待言。

            而立身处世，若连小小 一点念头都不向正途发展，其人品格之差亦不难想象了！由此可知，“小念头”一辞意带相关；创此名称的人用心良苦，堪作今日咏春派门人在“武”与“德”方面作立身处世之铭。

            在小念头中,“一摊三伏”的一组动作，可算是整套拳的重心。这组动作应越练越慢，直至出手或回手达到“力不断而若止.形似静而时动”的缓慢程度，方会领略此中之妙。若练到这一程度，便会逐渐感觉呼吸变得缓慢而深沉， 血气运行渐速，血管扩展而全身发熨。

            <img  style=" display: block;margin: auto;width: 80%;" src="https://pic1.zhimg.com/80/v2-fee9888b15ea9adbbbdfc500af71a5bc_1440w.jpg" />
            
            小念头摊手

            小念头有一特点——练习时自始至终不移一步。故此，练习小念头手法时，等于同时锻炼下盘功力；这就是初学者一开始即可练小念头，而无须像其他门派般先练好扎马才能学习初基拳套。

            咏春拳术重“借力巧打”。故练习咏春拳术必须注意以下的阶段：先懂“舍力”，继续“卸力”；精于卸力，方学“借力”。

            <h3>2 寻桥</h3>
            寻桥是咏春拳的中级套路。它以棱形运动路线和方向，结合咏春拳的攻防手法、步法、腿法等进行演练。 它的攻击手法有三推复掌，上、中、下三膀手，以及针步、弹腰、正、侧、内踢腿等，是咏春拳向高级套路过渡的必经阶段。“寻桥”是以敌我之间双方的对抗与互联当作一个对立统一的整体，去寻求己方肢体在互动的攻防格斗中快速打入取胜之路线。“寻桥”主要是锻炼简单直接实效的打人技术。
            
            <img  style=" display: block;margin: auto;width: 80%;" src="https://pic3.zhimg.com/80/v2-95608e9a1f62f931017101762dcc44ae_1440w.jpg" />
            <img  style=" display: block;margin: auto;width: 80%;" src="https://pic3.zhimg.com/80/v2-68554b12b05025b40c3abcf77ee67afe_1440w.jpg" />

            好比英文基本字母组成可以使用的字句文章一样，而其结构、章法、层次因个人而殊。

            <img  style=" display: block;margin: auto;width: 80%;" src="https://pic2.zhimg.com/80/v2-921b4c0bfe641433b2dba5227d4d52e1_1440w.jpg" />

            `,
        publishTime: "2021-04-23 21:23:20",
        readNums: "100",
        firstPic: "https://pic1.zhimg.com/80/v2-fee9888b15ea9adbbbdfc500af71a5bc_1440w.jpg",
    },
]

const getList = () => {
    return articles;
}

const getDetail = (articleId) => {
    return articles.find(article => article.id === articleId);
}

export default {
    getList,
    getDetail
}